; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v10 ?v9)
             (pred_11 ?v1 ?v2)
             (pred_3 ?v10 ?v2)
             (pred_9 ?v12 ?v10 )
	     (pred_8 ?v10)
             (pred_1 ?v11)
             (pred_5 ?v1)
             (pred_2 ?v2)
             (pred_12 ?v10)
             (pred_6 ?v1)
             (pred_10 ?v10)
             (pred_7 ))



(:action op_1
:parameters (?v3 ?v5 ?v8 ?v6)
:precondition (and (pred_1 ?v3) (pred_1 ?v5) (pred_5 ?v8) (pred_2 ?v6)
          (pred_4 ?v3 ?v5) (pred_11 ?v8 ?v6)
                   (pred_3 ?v5 ?v6) (pred_8 ?v3) 
                   (pred_12 ?v5) (pred_6 ?v8))
:effect (and  (pred_10 ?v5) (not (pred_12 ?v5))))


(:action op_5
:parameters (?v3 ?v4)
:precondition (and (pred_1 ?v3) (pred_1 ?v4)
               (pred_8 ?v3) (pred_4 ?v3 ?v4) (pred_10 ?v4))
:effect (and (pred_8 ?v4) (not (pred_8 ?v3))))

(:action op_4
:parameters (?v3 ?v8)
:precondition (and (pred_1 ?v3) (pred_5 ?v8) 
                  (pred_8 ?v3) (pred_9 ?v8 ?v3) (pred_7 ))
:effect (and (pred_6 ?v8)
   (not (pred_9 ?v8 ?v3)) (not (pred_7 ))))


(:action op_2
:parameters (?v3 ?v13 ?v7)
:precondition (and (pred_1 ?v3) (pred_5 ?v13) (pred_5 ?v7)
                  (pred_8 ?v3) (pred_6 ?v7) (pred_9 ?v13 ?v3))
:effect (and (pred_6 ?v13) (pred_9 ?v7 ?v3)
        (not (pred_6 ?v7)) (not (pred_9 ?v13 ?v3))))

(:action op_3
:parameters (?v3 ?v8)
:precondition (and (pred_1 ?v3) (pred_5 ?v8) 
                  (pred_8 ?v3) (pred_6 ?v8))
:effect (and (pred_7 ) (pred_9 ?v8 ?v3) (not (pred_6 ?v8)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_20 obj_13 obj_09 obj_11 obj_21 obj_04 obj_19 obj_01 obj_15 obj_16 obj_08 obj_02 obj_14 obj_22 obj_18
    obj_03 obj_17 obj_07
    obj_05 obj_10 obj_06
    )

    (:init
       (pred_7)

       (pred_1 obj_12)
       (pred_1 obj_20)
       (pred_1 obj_13)
       (pred_1 obj_09)
       (pred_1 obj_11)
       (pred_1 obj_21)
       (pred_1 obj_04)
       (pred_1 obj_19)
       (pred_1 obj_01)
       (pred_1 obj_15)
       (pred_1 obj_16)
       (pred_1 obj_08)
       (pred_1 obj_02)
       (pred_1 obj_14)
       (pred_1 obj_22)
       (pred_1 obj_18)
       (pred_2 obj_03)
       (pred_2 obj_17)
       (pred_2 obj_07)
       (pred_5 obj_05)
       (pred_5 obj_10)
       (pred_5 obj_06)

       (pred_4 obj_12 obj_11)
       (pred_4 obj_12 obj_20)
       (pred_4 obj_20 obj_21)
       (pred_4 obj_20 obj_13)
       (pred_4 obj_20 obj_12)
       (pred_4 obj_13 obj_04)
       (pred_4 obj_13 obj_09)
       (pred_4 obj_13 obj_20)
       (pred_4 obj_09 obj_19)
       (pred_4 obj_09 obj_13)
       (pred_4 obj_11 obj_01)
       (pred_4 obj_11 obj_21)
       (pred_4 obj_11 obj_12)
       (pred_4 obj_21 obj_15)
       (pred_4 obj_21 obj_04)
       (pred_4 obj_21 obj_20)
       (pred_4 obj_21 obj_11)
       (pred_4 obj_04 obj_16)
       (pred_4 obj_04 obj_19)
       (pred_4 obj_04 obj_13)
       (pred_4 obj_04 obj_21)
       (pred_4 obj_19 obj_08)
       (pred_4 obj_19 obj_09)
       (pred_4 obj_19 obj_04)
       (pred_4 obj_01 obj_02)
       (pred_4 obj_01 obj_15)
       (pred_4 obj_01 obj_11)
       (pred_4 obj_15 obj_14)
       (pred_4 obj_15 obj_16)
       (pred_4 obj_15 obj_21)
       (pred_4 obj_15 obj_01)
       (pred_4 obj_16 obj_22)
       (pred_4 obj_16 obj_08)
       (pred_4 obj_16 obj_04)
       (pred_4 obj_16 obj_15)
       (pred_4 obj_08 obj_18)
       (pred_4 obj_08 obj_19)
       (pred_4 obj_08 obj_16)
       (pred_4 obj_02 obj_14)
       (pred_4 obj_02 obj_01)
       (pred_4 obj_14 obj_22)
       (pred_4 obj_14 obj_15)
       (pred_4 obj_14 obj_02)
       (pred_4 obj_22 obj_18)
       (pred_4 obj_22 obj_16)
       (pred_4 obj_22 obj_14)
       (pred_4 obj_18 obj_08)
       (pred_4 obj_18 obj_22)
       (pred_12 obj_04)
       (pred_12 obj_08)
       (pred_12 obj_21)
       (pred_3  obj_04 obj_03)
       (pred_3  obj_08 obj_17)
       (pred_3  obj_21 obj_07)
       (pred_10 obj_12)
       (pred_10 obj_20)
       (pred_10 obj_13)
       (pred_10 obj_09)
       (pred_10 obj_11)
       (pred_10 obj_19)
       (pred_10 obj_01)
       (pred_10 obj_15)
       (pred_10 obj_16)
       (pred_10 obj_02)
       (pred_10 obj_14)
       (pred_10 obj_22)
       (pred_10 obj_18)

       (pred_11  obj_05 obj_03)
       (pred_11  obj_10 obj_17)
       (pred_11  obj_06 obj_07)
       (pred_9 obj_05 obj_09)
       (pred_9 obj_10 obj_04)
       (pred_9 obj_06 obj_02)
       (pred_8 obj_22)
    )

    (:goal (and
       (pred_9 obj_06 obj_01)
    ))
(:constraints
  (always (not (pred_8 obj_14)))
)
)

; plan
1. (op_5 obj_22 obj_16)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_16)
   goals met: 0 of 1
2. (op_5 obj_16 obj_15)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_15)
   goals met: 0 of 1
3. (op_5 obj_15 obj_01)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_01)
   goals met: 0 of 1
4. (op_5 obj_01 obj_02)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_02)
   goals met: 0 of 1
5. (op_4 obj_02 obj_06)
   deleted: (pred_9 obj_06 obj_02) (pred_7)
   added: (pred_6 obj_06)
   goals met: 0 of 1
6. (op_5 obj_02 obj_01)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_01)
   goals met: 0 of 1
7. (op_3 obj_01 obj_06)
   deleted: (pred_6 obj_06)
   added: (pred_7) (pred_9 obj_06 obj_01)
   goals met: 1 of 1
